tangyangguang/FarmAuto/firmware/master-esp32/src/webapp/fa_master_web.cpp
#include "fa_master_web.h"

#include <Arduino.h>
#include <Esp32Base.h>
#include <stdlib.h>
#include <string.h>

#include "fa_action_record_store.h"

namespace {

constexpr const char* kNs = "fa_feed";
constexpr const char* kStationAddress = "addr";
constexpr const char* kPulsesPerTurn = "ppt";
constexpr const char* kGramsPerTurnMg = "gpt_mg";
constexpr const char* kDirection = "dir";
constexpr const char* kSpeedPermille = "speed";
constexpr const char* kOverCurrentMa = "oc_ma";
constexpr const char* kMaxRunMs = "max_ms";
constexpr const char* kMaxActionPulses = "max_p";
constexpr uint16_t kSingleFeederDeviceId = 1u;
constexpr uint8_t kRecentRecordLimit = 8u;

FaFeedService* g_feed_service = nullptr;
FaRs485Master* g_rs485_master = nullptr;
FaRs485Transport* g_transport = nullptr;
FaMasterActionRuntime* g_action_runtime = nullptr;

uint32_t readUIntParam(const char* name, uint32_t fallback) {
    char raw[16] = "";
    if (!Esp32BaseWeb::getParam(name, raw, sizeof(raw)) || raw[0] == '\0') {
        return fallback;
    }
    char* end = nullptr;
    const unsigned long value = strtoul(raw, &end, 10);
    if (end == raw || *end != '\0') {
        return fallback;
    }
    return static_cast<uint32_t>(value);
}

FaFeedDeviceConfig readFeedConfig(void) {
    FaFeedDeviceConfig config;
    config.station_address = static_cast<uint8_t>(Esp32BaseConfig::getInt(kNs, kStationAddress, 1));
    config.config_version = 1u;
    config.pulses_per_turn = static_cast<uint32_t>(Esp32BaseConfig::getInt(kNs, kPulsesPerTurn, 4320));
    config.grams_per_turn_mg = static_cast<uint32_t>(Esp32BaseConfig::getInt(kNs, kGramsPerTurnMg, 8000));
    config.feed_direction = static_cast<int8_t>(Esp32BaseConfig::getInt(kNs, kDirection, 1));
    config.speed_permille = static_cast<uint16_t>(Esp32BaseConfig::getInt(kNs, kSpeedPermille, 800));
    config.accel_ms = 0u;
    config.decel_ms = 0u;
    config.over_current_ma = static_cast<uint16_t>(Esp32BaseConfig::getInt(kNs, kOverCurrentMa, 2000));
    config.over_current_hold_ms = 100u;
    config.stall_detect_ms = 500u;
    config.stall_min_delta_pulses = 10u;
    config.max_run_ms = static_cast<uint32_t>(Esp32BaseConfig::getInt(kNs, kMaxRunMs, 60000));
    config.max_action_pulses = static_cast<uint32_t>(Esp32BaseConfig::getInt(kNs, kMaxActionPulses, 432000));
    return config;
}

const char* statusName(uint8_t status) {
    switch (status) {
    case FA_STATUS_OK:
        return "ok";
    case FA_STATUS_ERR_BAD_PARAM:
        return "bad_param";
    case FA_STATUS_ERR_NOT_CONFIGURED:
        return "not_configured";
    case FA_STATUS_ERR_BUSY:
        return "busy";
    case FA_STATUS_ERR_FAULT_ACTIVE:
        return "fault_active";
    case FA_STATUS_ERR_ACTION_DUPLICATE:
        return "action_duplicate";
    case FA_STATUS_ERR_SAFETY_BLOCKED:
        return "safety_blocked";
    case FA_STATUS_ERR_BAD_LENGTH:
        return "bad_length";
    case FA_STATUS_ERR_UNSUPPORTED_VERSION:
        return "unsupported_version";
    case FA_STATUS_ERR_ADDRESS_RESERVED:
        return "address_reserved";
    case FA_STATUS_ERR_INTERNAL:
        return "internal";
    default:
        return "error";
    }
}

void sendNumber(uint32_t value) {
    char buf[16];
    snprintf(buf, sizeof(buf), "%lu", static_cast<unsigned long>(value));
    Esp32BaseWeb::sendChunk(buf);
}

const char* frameResultName(FaFrameResult result) {
    switch (result) {
    case FA_FRAME_OK:
        return "ok";
    case FA_FRAME_ERR_NULL:
        return "null";
    case FA_FRAME_ERR_TOO_SHORT:
        return "too_short";
    case FA_FRAME_ERR_BAD_SOF:
        return "bad_sof";
    case FA_FRAME_ERR_UNSUPPORTED_VERSION:
        return "unsupported_version";
    case FA_FRAME_ERR_PAYLOAD_TOO_LONG:
        return "payload_too_long";
    case FA_FRAME_ERR_LENGTH_MISMATCH:
        return "length_mismatch";
    case FA_FRAME_ERR_CRC:
        return "crc";
    case FA_FRAME_ERR_OUTPUT_TOO_SMALL:
        return "output_too_small";
    default:
        return "frame_error";
    }
}

const char* recordStateName(uint8_t state) {
    switch (state) {
    case FA_ACTION_RECORD_RUNNING:
        return "running";
    case FA_ACTION_RECORD_COMPLETED:
        return "completed";
    case FA_ACTION_RECORD_STOPPED:
        return "stopped";
    case FA_ACTION_RECORD_FAILED:
        return "failed";
    default:
        return "unknown";
    }
}

const char* stopReasonName(uint8_t reason) {
    switch (reason) {
    case FA_STOP_NONE:
        return "none";
    case FA_STOP_TARGET_REACHED:
        return "target";
    case FA_STOP_MASTER_COMMAND:
        return "master_stop";
    case FA_STOP_OVER_CURRENT:
        return "over_current";
    case FA_STOP_STALL:
        return "stall";
    case FA_STOP_TIMEOUT:
        return "timeout";
    case FA_STOP_TARGET_OVERRUN:
        return "overrun";
    case FA_STOP_WATCHDOG:
        return "watchdog";
    case FA_STOP_LOCAL_FAULT:
        return "local_fault";
    default:
        return "unknown";
    }
}

const char* faultName(uint16_t fault) {
    switch (fault) {
    case FA_FAULT_NONE:
        return "none";
    case FA_FAULT_OVER_CURRENT:
        return "over_current";
    case FA_FAULT_STALL:
        return "stall";
    case FA_FAULT_ENCODER_LOST:
        return "encoder_lost";
    case FA_FAULT_RUN_TIMEOUT:
        return "run_timeout";
    case FA_FAULT_TARGET_OVERRUN:
        return "target_overrun";
    case FA_FAULT_CONFIG_INVALID:
        return "config_invalid";
    case FA_FAULT_DRIVER_ABNORMAL:
        return "driver_abnormal";
    case FA_FAULT_CURRENT_SENSOR:
        return "current_sensor";
    case FA_FAULT_WATCHDOG_RESET:
        return "watchdog_reset";
    case FA_FAULT_RESERVED_ADDRESS:
        return "reserved_address";
    case FA_FAULT_COMMAND_REJECTED:
        return "command_rejected";
    case FA_FAULT_COMMUNICATION:
        return "communication";
    default:
        return "unknown";
    }
}

void formatDurationMs(uint32_t ms, char* out, size_t len) {
    if (out == nullptr || len == 0u) {
        return;
    }
    if (ms >= 1000u) {
        snprintf(out, len, "%lu.%03lus", static_cast<unsigned long>(ms / 1000u), static_cast<unsigned long>(ms % 1000u));
    } else {
        snprintf(out, len, "%lums", static_cast<unsigned long>(ms));
    }
}

