tangyangguang/FarmAuto/firmware/master-esp32/src/webapp/fa_master_web.cpp
void formatTimeValue(uint32_t seconds, char* out, size_t len) {
    if (out == nullptr || len == 0u) {
        return;
    }
    if (seconds == 0u) {
        snprintf(out, len, "-");
        return;
    }
    if (!Esp32BaseTime::formatEpoch(seconds, out, len, "%m-%d %H:%M:%S")) {
        snprintf(out, len, "%lus", static_cast<unsigned long>(seconds));
    }
}

void formatAmount(const FaActionRecord& record, char* out, size_t len) {
    if (out == nullptr || len == 0u) {
        return;
    }
    if (record.amount_mode == FA_FEED_AMOUNT_MG) {
        snprintf(out, len, "%lu mg", static_cast<unsigned long>(record.amount_value));
    } else if (record.amount_mode == FA_FEED_AMOUNT_TURNS_X1000) {
        snprintf(out, len, "%lu/1000 turn", static_cast<unsigned long>(record.amount_value));
    } else {
        snprintf(out, len, "%lu", static_cast<unsigned long>(record.amount_value));
    }
}

void sendRecordTableRow(const FaActionRecord& record) {
    char started[24];
    char duration[20];
    char amount[28];
    formatTimeValue(record.started_at_s, started, sizeof(started));
    formatDurationMs(record.run_ms, duration, sizeof(duration));
    formatAmount(record, amount, sizeof(amount));

    Esp32BaseWeb::sendChunk("<tr><td>");
    sendNumber(record.action_id);
    Esp32BaseWeb::sendChunk("</td><td>");
    Esp32BaseWeb::writeHtmlEscaped(recordStateName(record.state));
    Esp32BaseWeb::sendChunk("</td><td>");
    Esp32BaseWeb::writeHtmlEscaped(started);
    Esp32BaseWeb::sendChunk("</td><td>");
    Esp32BaseWeb::writeHtmlEscaped(amount);
    Esp32BaseWeb::sendChunk("</td><td>");
    sendNumber(record.completed_pulses);
    Esp32BaseWeb::sendChunk(" / ");
    sendNumber(record.target_pulses);
    Esp32BaseWeb::sendChunk("</td><td>");
    Esp32BaseWeb::writeHtmlEscaped(duration);
    Esp32BaseWeb::sendChunk("</td><td>");
    sendNumber(record.bus_address);
    Esp32BaseWeb::sendChunk("</td><td>");
    Esp32BaseWeb::writeHtmlEscaped(stopReasonName(record.stop_reason));
    Esp32BaseWeb::sendChunk("</td><td>");
    Esp32BaseWeb::writeHtmlEscaped(faultName(record.fault_code));
    Esp32BaseWeb::sendChunk("</td></tr>");
}

void sendActiveActionPanel(void) {
    if (g_action_runtime == nullptr || !g_action_runtime->isBusy()) {
        return;
    }

    const FaActionRecord* active = g_action_runtime->activeRecord();
    if (active == nullptr) {
        return;
    }

    char amount[28];
    formatAmount(*active, amount, sizeof(amount));
    Esp32BaseWeb::beginPanel("Active action");
    Esp32BaseWeb::sendInfoRowCompact("Action", "Currently tracked by master polling.", recordStateName(active->state));
    Esp32BaseWeb::sendInfoRowCompact("Amount", "Original manual request.", amount);
    char progress[36];
    snprintf(progress, sizeof(progress), "%lu / %lu pulses",
             static_cast<unsigned long>(active->completed_pulses),
             static_cast<unsigned long>(active->target_pulses));
    Esp32BaseWeb::sendInfoRowCompact("Progress", "Last status returned by station.", progress);
    Esp32BaseWeb::sendInfoRowCompact("Last error", "Last master-side polling error.", g_action_runtime->lastError());
    Esp32BaseWeb::endPanel();
}

void sendRecentRecordsPanel(void) {
    Esp32BaseWeb::beginPanel("Recent records");
    if (!FaActionRecordStore::isReady()) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "Records unavailable", "LittleFS action record store is not ready.");
        Esp32BaseWeb::endPanel();
        return;
    }
    const uint16_t count = FaActionRecordStore::count();
    if (count == 0u) {
        Esp32BaseWeb::sendInfoRowCompact("No records", "Completed or failed actions will appear here.");
        Esp32BaseWeb::endPanel();
        return;
    }

    const uint16_t limit = count < kRecentRecordLimit ? count : kRecentRecordLimit;
    Esp32BaseWeb::sendChunk("<div class='tablewrap'><table class='evtable'><thead><tr><th>ID</th><th>State</th><th>Started</th><th>Amount</th><th>Pulses</th><th>Run</th><th>Addr</th><th>Stop</th><th>Fault</th></tr></thead><tbody>");
    for (uint16_t i = 0u; i < limit; ++i) {
        FaActionRecord record;
        if (FaActionRecordStore::readLatest(i, record)) {
            sendRecordTableRow(record);
        }
    }
    Esp32BaseWeb::sendChunk("</tbody></table></div>");
    Esp32BaseWeb::endPanel();
}

void sendFeedTransportError(uint16_t http_code, const char* stage, const char* error_key, const char* error_value) {
    Esp32BaseWeb::beginJson(http_code);
    Esp32BaseWeb::sendChunk("\"ok\":false,\"stage\":\"");
    Esp32BaseWeb::sendChunk(stage);
    Esp32BaseWeb::sendChunk("\",\"");
    Esp32BaseWeb::sendChunk(error_key);
    Esp32BaseWeb::sendChunk("\":\"");
    Esp32BaseWeb::sendChunk(error_value);
    Esp32BaseWeb::sendChunk("\"");
    Esp32BaseWeb::endJson();
}

bool transactAndParseCommon(uint8_t station_address,
                            uint8_t expected_seq,
                            uint8_t expected_cmd,
                            const uint8_t* request,
                            size_t request_len,
                            FaMasterCommonResponse* common,
                            const char* stage) {
    if (common != nullptr) {
        memset(common, 0, sizeof(*common));
    }
    uint8_t response[FA_MAX_FRAME_LEN];
    size_t response_len = 0u;
    const FaRs485TransportStatus tx_status = g_transport->transact(request, request_len, response, sizeof(response), &response_len, 0u);
    if (tx_status != FaRs485TransportStatus::OK) {
        sendFeedTransportError(tx_status == FaRs485TransportStatus::TIMEOUT ? 504 : 502,
                               stage,
                               "transport",
                               FaRs485Transport::statusName(tx_status));
        return false;
    }

    const uint8_t status = fa_rs485_master_parse_common(response, response_len, station_address, expected_seq, expected_cmd, common);
    if (status != FA_STATUS_OK) {
        Esp32BaseWeb::beginJson(502);
        Esp32BaseWeb::sendChunk("\"ok\":false,\"stage\":\"");
        Esp32BaseWeb::sendChunk(stage);
        Esp32BaseWeb::sendChunk("\",\"status\":\"");
        Esp32BaseWeb::sendChunk(statusName(status));
        Esp32BaseWeb::sendChunk("\",\"faultCode\":");
        sendNumber(common != nullptr ? common->fault_code : 0u);
        Esp32BaseWeb::endJson();
        return false;
    }
    return true;
}

void sendFeedPage(void) {
    if (!Esp32BaseWeb::checkAuth()) {
        return;
    }

    const FaFeedDeviceConfig config = readFeedConfig();
    char value[24];

    Esp32BaseWeb::sendHeader("Feed");
    Esp32BaseWeb::sendPageTitle("Manual feed", "Sends one bounded feeder action when RS485 is configured; otherwise previews it.");

    Esp32BaseWeb::beginMetricGrid();
    snprintf(value, sizeof(value), "%u", config.station_address);
    Esp32BaseWeb::sendMetric("Station", value, "RS485 address");
    snprintf(value, sizeof(value), "%lu", static_cast<unsigned long>(config.pulses_per_turn));
    Esp32BaseWeb::sendMetric("Pulses/turn", value);
    snprintf(value, sizeof(value), "%lu", static_cast<unsigned long>(config.grams_per_turn_mg));
    Esp32BaseWeb::sendMetric("mg/turn", value);
    snprintf(value, sizeof(value), "%u", FaActionRecordStore::count());
    Esp32BaseWeb::sendMetric("Records", value, FaActionRecordStore::isReady() ? "LittleFS ring ready" : "Store unavailable");
    Esp32BaseWeb::sendMetric("RS485", g_transport != nullptr && g_transport->isReady() ? "ready" : "not configured");
    Esp32BaseWeb::sendMetric("Action", g_action_runtime != nullptr && g_action_runtime->isBusy() ? "running" : "idle");
    Esp32BaseWeb::endMetricGrid();

    Esp32BaseWeb::beginPanel("Run");
    Esp32BaseWeb::sendChunk("<form method='post' action='/api/feed/manual' onsubmit='return once(this)'><div class='fieldgrid'>");
    Esp32BaseWeb::sendChunk("<div class='field med'><label>Amount</label><input type='number' name='amount' min='1' max='1000000' value='4000'><small>Stored as mg or turns x1000.</small></div>");
    Esp32BaseWeb::sendChunk("<div class='field med'><label>Mode</label><select name='mode'><option value='mg'>mg</option><option value='turns'>turns x1000</option></select><small>Use App Config for calibration.</small></div>");
    Esp32BaseWeb::sendChunk("</div><div class='actions'><input type='submit' value='Run / preview'></div></form>");
    Esp32BaseWeb::endPanel();

